# IEntryPoint Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IEntryPoint Interface
Members See Also
---
The interface supporting Document and Application level entry point classes for macros.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public interface IEntryPoint
```

Visual Basic
---
```text
Public Interface IEntryPoint
```

Visual C++
---
```text
public interface class IEntryPoint
```

# See Also
IEntryPoint Members
Autodesk.Revit.DB.Macros Namespace